docs/tracking/2026-03-09_FIRST_CLASS_TRAITS_PIR.tex
\subsection{3.4 Phase 3d Was Surgical}
\label{sec:orgfb49f6b}

Removing the batch \texttt{resolve-trait-constraints!} post-pass — the most architecturally
significant change — required modifying only 2 files:

\begin{itemize}
\item \texttt{metavar-store.rkt}: 8 lines added (immediate-resolve for already-ground type-args)
\item \texttt{expander.rkt}: 4 call sites removed (replaced with comments)
\end{itemize}

The incremental resolution infrastructure had been built across prior sprints (Sprint
5–9) and the FL Narrowing track. Phase 3d merely removed the redundant batch fallback.
This validates the architectural principle: when the incremental path is correct, the
batch path is pure overhead.
\subsection{3.5 Zero Regressions}
\label{sec:org5faa507}

All 6,681 tests pass after every phase. No existing test broke during the entire
feature track. The new infrastructure is purely additive — it doesn't modify existing
dispatch or resolution behavior, only adds new entry points.

\noindent\rule{\textwidth}{0.5pt}
\section{4. What Was Challenging}
\label{sec:org4615807}

\subsection{4.1 Constraint Chain Reader Integration}
\label{sec:orgcd309f8}

Phase 3c's \texttt{?var:C1:C2} syntax required changes at three pipeline stages:

\begin{itemize}
\item \textbf{Reader} (\texttt{reader.rkt}): Greedy consumption of \texttt{:UpperCase} segments into a single
token. The reader must distinguish \texttt{?x:Nat} (constraint chain) from \texttt{?x:nat}
(lowercase, not a constraint) and \texttt{?x :} expr= (assignment, not a constraint).
\item \textbf{Parser} (\texttt{parser.rkt}): Split the combined token into variable name + constraint list.
\item \textbf{Surface syntax} (\texttt{surface-syntax.rkt}): New \texttt{surf-constrained-lvar} struct.
\end{itemize}

The greedy reader approach is simple but means constraint chains can't contain lowercase
identifiers (e.g., \texttt{?x:myType} won't parse as a constraint). This is consistent with
the naming convention (types are UpperCase) but is a design trade-off worth noting.
\subsection{4.2 WS-Mode Gaps in HasMethod Syntax}
\label{sec:orgad3912d}

Phase 3a's \texttt{:over/:method} spec metadata works in sexp mode but has no WS surface
syntax. The WS preparser's spec metadata parser (\texttt{macros.rkt}) would need extension
to recognize these keywords in whitespace-significant mode. This was intentionally
deferred (tracked in DEFERRED.md) as a WS integration task, but it means the
capstone demo can only show HasMethod as commented ideal syntax.
\subsection{4.3 Narrowing Through Complex DTs}
\label{sec:orgbdfa283}

The capstone demo revealed that backward narrowing through wrapper functions and
nested pattern matches doesn't always produce expected results. See §6 (Demo Issue
Catalogue) for details. These aren't Stage 3 bugs per se — they're limitations of
the narrowing engine's DT-guided search that Stage 3's trait dispatch exposes more
visibly.

\noindent\rule{\textwidth}{0.5pt}
\section{5. How Results Compared to Expectations}
\label{sec:orgdcebef5}

\subsection{5.1 Timeline: Faster Than Expected}
\label{sec:orgd8496c4}

The design document suggested a multi-session implementation. Actual: single session.
Contributing factors:

\begin{itemize}
\item Mature infrastructure: no new lattice/propagator primitives needed
\item Phase 1 established the pattern; subsequent phases were variations
\item The out-of-order Phase 3a decision (HasMethod before propagators) parallelized
the conceptual work: sexp-mode spec metadata is independent of narrowing
\end{itemize}
\subsection{5.2 Test Count: Almost Exactly As Expected}
\label{sec:org013651d}

391 new test cases across 8 test files. The distribution:

\begin{center}
\begin{tabular}{lr}
Test File & Cases\\
\hline
test-constraint-cell-01.rkt & 99\\
test-constraint-chain-01.rkt & 59\\
test-constraint-propagators-01.rkt & 56\\
test-trait-introspection-01.rkt & 56\\
test-trait-tycon-01.rkt & 45\\
test-hasmethod-01.rkt & 34\\
test-constraint-amb-01.rkt & 26\\
test-trait-narrowing-01.rkt & 16\\
\hline
\textbf{Total} & \textbf{391}\\
\end{tabular}
\end{center}
\subsection{5.3 Scope: Clean Completion}
\label{sec:org040a16d}

No phases deferred, no scope creep. The design document's 9-phase structure matched
the implementation exactly. The only structural deviation was phase ordering (3a
before 2c–2d), which was a beneficial optimization, not a deviation.
\subsection{5.4 Architecture: Constraint Cell Generalization Was the Right Call}
\label{sec:org2224f08}

The design document's transition from \texttt{dispatch-lattice} to \texttt{constraint-cell} (§4.1)
proved correct. The same module supports dispatch cells, and the API is clean enough
that future constraint types (interval, predicate) can plug in without modification.

\noindent\rule{\textwidth}{0.5pt}
\section{6. Demo Issue Catalogue}
\label{sec:orgac72452}

The capstone demo (\texttt{examples/2026-03-09-fc-trait-rel-dom.prologos}) surfaced 7
categories of issues when evaluated from a source-connected REPL. These are
catalogued here with hypotheses; none are addressed in this PIR.
\subsection{Issue 1: String \texttt{add} resolves to Nat FQN (Line 76)}
\label{sec:org4fa6348}

\textbf{Symptom}: \texttt{[add "hello " "world"]} returns \texttt{nil} instead of \texttt{"hello world"}.

\textbf{Hypothesis}: The expression evaluates as \texttt{[prologos::data::nat::add "hello " "world"]}
(per the error trace). The generic \texttt{add} is resolving to the Nat instance's FQN
instead of String's \texttt{String-{}-{}Add-{}-{}dict}. This may be a prelude import ordering issue:
the Nat-specific \texttt{add} function (non-generic, defined in \texttt{prologos::data::nat}) shadows
the generic \texttt{add} trait method.
\subsection{Issue 2: Multiplication/subtraction narrowing returns nil (Lines 114, 118)}
\label{sec:org237c13d}

\textbf{Symptom}: \texttt{mult ?x ?y = 6N} and \texttt{sub ?x ?y = 3N} return \texttt{nil} or incomplete results.

\textbf{Hypothesis}: Nat multiplication is defined via recursive addition, creating a DT
with deep nesting. The backward search exhausts its fuel (default depth limit) before
finding factor pairs. Saturating subtraction (\texttt{sub 3N 5N = 0N}) creates a non-injective
DT that the backward search over-approximates. These are narrowing engine depth/shape
limitations, not Stage 3 bugs.
\subsection{Issue 3: Wrapper function narrowing over-approximates (Lines 216, 219, 336)}
\label{sec:org6c516d2}

\textbf{Symptom}: \texttt{[my-double ?x] = 6N} returns \texttt{'[\{:x 6N\} \{:x 5N\} \{:x 4N\} \{:x 3N\}]}
instead of \texttt{'[\{:x 3N\}]}.

\textbf{Hypothesis}: \texttt{my-double} is defined as \texttt{[add n n]}, creating a trivial DT that wraps
\texttt{add}. When narrowing backwards, the engine decomposes to \texttt{add ?n ?n = 6N} but treats
the two \texttt{?n} occurrences as independent variables (no aliasing constraint). The DT
search finds all \texttt{(x, y)} pairs where \texttt{x + y = 6}, not just the diagonal \texttt{x = y}.
This is a known limitation of DT-guided narrowing for non-linear patterns — aliased
variables require either equational unification or a post-filter.
\subsection{Issue 4: String pipe type error (Line 252)}
\label{sec:orge527f78}

\textbf{Symptom}: \texttt{"hello" |> [add " "] |> [add "world"]} produces a type error referencing
\texttt{prologos::data::nat::add}.

\textbf{Hypothesis}: Same root cause as Issue 1 — generic \texttt{add} resolves to the Nat-specific
function rather than the String trait instance. The pipe merely exposes it in a
different context. The partially-applied \texttt{[add " "]} elaborates with the Nat FQN,
then fails when applied to a String argument.
\subsection{Issue 5: Recursive \texttt{even?} narrowing returns nil (Line 284)}
\label{sec:org5a8de04}

\textbf{Symptom}: \texttt{[even? ?n:Nat] = true} returns \texttt{nil}.

\textbf{Hypothesis}: \texttt{even?} has a nested match (match-within-match) that creates a complex
DT with recursive calls. The backward search either: (a) exceeds depth for the
recursive \texttt{even?} call in the \texttt{suc (suc j)} branch, or (b) the nested match
generates a DT shape that the backward walker doesn't decompose correctly. Nested
match DT extraction is a known area for improvement.
