docs/tracking/2026-03-09_FIRST_CLASS_TRAITS_PIR.tex
\subsection{Issue 6: \texttt{compare} and \texttt{eq?} are unbound (Lines 303, 306, 310, 313)}
\label{sec:orgfae316f}

\textbf{Symptom}: \texttt{Unbound variable: compare} and \texttt{Unbound variable: eq?}.

\textbf{Hypothesis}: The prelude's \texttt{:refer} lists for \texttt{prologos::core::ord} and
\texttt{prologos::core::eq} export wrapper functions (\texttt{ord-lt}, \texttt{eq-check}, \texttt{nat-eq}) but
\textbf{not} the trait method names (\texttt{compare}, \texttt{eq?}) themselves. The trait method names
are defined inside trait bodies and are only accessible through dict dispatch, not as
standalone functions. To use them, the user must either: (a) call the wrapper
(\texttt{eq-check}, \texttt{ord-compare}), or (b) import the method explicitly. The capstone demo
assumed these were prelude-exported generic functions.
\subsection{Issue 7: \texttt{collatz-step} fails to parse (Lines 463–476)}
\label{sec:org87ce3b3}

\textbf{Symptom}: \texttt{Unbound variable: spec} and \texttt{defn requires: ...} errors.

\textbf{Hypothesis}: The \texttt{spec=/=defn} pair at lines 463–464 is being parsed in an unexpected
context. Possible causes: (a) A prior expression's evaluation changed the parser
state (e.g., the file-level \texttt{ns} form expects all subsequent forms to be in expression
mode after the narrowing queries). (b) The WS-mode file processor treats narrowing
queries (\texttt{add ?x ?y = 5N}) as expressions, and after processing them, the parser
context may not reset to accept new declaration forms. (c) There may be a scoping
interaction where the prior \texttt{even?} definition's recursive DT leaves the parser in
a state that doesn't recognize subsequent \texttt{spec} forms.

\noindent\rule{\textwidth}{0.5pt}
\section{7. Architectural Validation}
\label{sec:org588a2fb}

\subsection{7.1 Propagator-as-Universal-Substrate: Confirmed (Third Time)}
\label{sec:orgf4def67}

Stage 3 is the fourth domain using the propagator network:

\begin{center}
\begin{tabular}{llll}
Domain & Cells & Propagators & Committed\\
\hline
Type inference & Type lattice cells & Unification propagators & Sprint 5\\
QTT & Multiplicity cells & mult-propagators & Sprint 7\\
Session types & Session lattice cells & Send/recv/duality propagators & S4\\
\textbf{Trait dispatch} & \textbf{Constraint cells (dispatch)} & \textbf{P1–P4 (type↔constraint↔method)} & \textbf{Stage 3}\\
\end{tabular}
\end{center}

Zero changes to \texttt{propagator.rkt} across all four domains. The abstraction holds.
\subsection{7.2 AST Pipeline Extension Points}
\label{sec:orgb2e0c4c}

Stage 3 touched 14 of the 14 AST pipeline files (syntax → surface → parser →
elaborator → typing-core → qtt → reduction → substitution → zonk → pretty-print +
unify, macros, foreign). The extension points — adding new struct types to \texttt{syntax.rkt}
and \texttt{surface-syntax.rkt}, adding elaboration cases to \texttt{elaborator.rkt}, adding
reduction rules to \texttt{reduction.rkt} — all worked as expected.

The one friction point: \texttt{macros.rkt} (WS desugaring) is 7,600+ lines and growing.
Spec metadata parsing for new keywords (\texttt{:over}, \texttt{:method}) required understanding a
1,200-line function. This is not a correctness issue but an ergonomics issue for
future developers.
\subsection{7.3 Narrowing Engine Integration}
\label{sec:orgdc2a0e4}

The narrowing engine (\texttt{narrowing.rkt}) required only 11 lines of changes — a hook
for trait-resolved operator dispatch. This validates the DT-based architecture: trait
dispatch is orthogonal to the search algorithm. The narrowing engine doesn't know or
care about traits; it receives concrete DTs after dispatch resolution and walks them
backwards as before.

However, the demo issues (§6) reveal that this clean separation has a cost: the
narrowing engine can't exploit trait-level information (e.g., knowing that \texttt{add} is
commutative) for search pruning. The DT is the only interface, and DTs don't carry
algebraic properties.

\noindent\rule{\textwidth}{0.5pt}
\section{8. Forward Enablement}
\label{sec:orgd13aba4}

\subsection{8.1 WS Surface for HasMethod (Immediate)}
\label{sec:orgd3f2e74}

Phase 3a's \texttt{:over/:method} works in sexp mode. Wiring up WS surface syntax is a
straightforward parser extension — add keyword recognition to \texttt{parse-spec-metadata}
in the WS preparser path. This would complete the capstone demo's §12.
\subsection{8.2 Parameterized Constraints (Medium-Term)}
\label{sec:org6ddf715}

The design document specifies \texttt{?n:Between[50 100]:Even} syntax with parameterized
constraints. The reader already handles \texttt{?var:C} chains; extending to \texttt{C[args]} requires
a small reader change (recognize \texttt{[} after a constraint identifier). The
\texttt{constraint-cell.rkt} lattice is domain-generic and handles parameterized constraints
without modification.
\subsection{8.3 Narrowing Improvements (Informed by Demo Issues)}
\label{sec:org775387d}

The demo issues point to three specific narrowing improvements:

\begin{enumerate}
\item \textbf{Variable aliasing in DT search} (Issue 3): When a function uses a variable
non-linearly (\texttt{[add n n]}), the backward search should unify the alias
occurrences, not treat them as independent. This requires equational constraints
in the DT walk.

\item \textbf{Depth-bounded multiplication/subtraction} (Issue 2): Deeper fuel or iterative
deepening for recursive DTs.

\item \textbf{Nested match DT extraction} (Issue 5): Match-within-match should produce
composed DTs, not flat ones.
\end{enumerate}
\subsection{8.4 Trait Method Re-export (Informed by Demo Issue 6)}
\label{sec:org1335cd1}

The prelude should export trait method names (\texttt{eq?}, \texttt{compare}) as generic functions,
not just wrapper functions. This is a \texttt{namespace.rkt} change — add the trait method
names to the \texttt{:refer} lists for \texttt{prologos::core::eq} and \texttt{prologos::core::ord}.

\noindent\rule{\textwidth}{0.5pt}
\section{9. Lessons Learned}
\label{sec:orge6dc16b}

\subsection{9.1 Technical Lessons}
\label{sec:orgd9fe86f}

\begin{enumerate}
\item \textbf{Constraint cells generalize dispatch cells.} Starting with a domain-specific
\texttt{dispatch-lattice} and generalizing to \texttt{constraint-cell} during implementation
was the right move. The generalization was free and enables future constraint types.

\item \textbf{Registry-based dispatch > static operator table.} Phase 2c replaced a static table
mapping operators to trait names with a dynamic registry lookup. This means
user-defined traits automatically participate in narrowing dispatch without
code changes.

\item \textbf{Immediate-resolve safety net for ground type-args.} In \texttt{register-trait-constraint!},
if all type-args are already ground (no metas), the wakeup map has no entries and
incremental resolution would never fire. The safety net (Phase 3d) invokes the
resolve callback immediately. Without this, already-ground constraints would silently
fail.

\item \textbf{Prelude export lists are a user-facing API.} The demo's \texttt{compare=/=eq?} unbound
errors (Issue 6) show that what's in the \texttt{:refer} list is what users can call.
Trait method names should be treated as first-class exports, not internal
implementation details.

\item \textbf{Non-linear DT variables need equational unification.} The \texttt{my-double} over-
approximation (Issue 3) reveals a fundamental gap: DT-guided backward search
treats each variable occurrence independently. Functions with aliased variables
(\texttt{[add n n]}) need either: (a) a post-filter unifying alias groups, or (b)
equational constraints threaded through the DT walk.
\end{enumerate}
